[
  {
    "title": "Amazon and Chobani adopt Strella's AI interviews for customer research as fast-growing startup raises $14M",
    "url": "https://venturebeat.com/ai/amazon-and-chobani-adopt-strellas-ai-interviews-for-customer-research-as",
    "source": "VentureBeat",
    "published": "2025-10-17T22:55:16+00:00",
    "score": 81,
    "summary": "One year after emerging from stealth, Strella has raised $14 million in Series A funding to expand its AI-powered customer research platform, the company announced Thursday. The company is approaching $1 million in revenue after beginning monetization only in January, with month-over-month growth of 50% and zero customer churn to date. \"UX Research is a sub-sector of the $140B+ global market-research industry,\" Li said."
  },
  {
    "title": "Top OpenAI, Google Brain researchers set off a $300M VC frenzy for their startup...",
    "url": "https://techcrunch.com/2025/10/20/top-openai-google-brain-researchers-set-off-a-300m-vc-frenzy-for-their-startup-periodic-labs/",
    "source": "TechCrunch",
    "published": "2025-10-20T20:55:25+00:00",
    "score": 73,
    "summary": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Periodic Labs, a new startup by one of OpenAI’s most respected researchers, Liam Fedus, and his former Google Brain colleague, Ekin Dogus Cubuk, came out of stealth last month with an enormous $300 million seed round . With the $300 million war chest, Cubuk and Fedus hired over two dozen of the most prestigious AI and scientific talent like Alexandre Passos (a creator of o1 and o3); Eric Toberer (a materials scientist who has already made key superconductor discoveries) and Matt Horton, a creator of two of Microsoft’s GenAI materials science tools. Kohler unveils a camera for your toilet WhatsApp changes its terms to bar general-purpose chatbots from its platform WhatsApp will curb the number of messages people and businesses can send without a response Amazon’s Ring to partner with Flock, a network of AI cameras used by ICE, feds, and police Eightfold co-founders raise $35M for Viven, an AI digital twin startup for querying unavailable co-workers Sam Altman says ChatGPT will soon allow erotica for adult users Google’s Gemini can now help you schedule Google Calendar meetings © 2025 TechCrunch Media LLC."
  },
  {
    "title": "Catastrophe insurer Stand secures $35m in Series B funding",
    "url": "https://finance.yahoo.com/news/catastrophe-insurer-stand-secures-35m-112330853.html",
    "source": "Life Insurance International",
    "published": "2025-10-17T22:55:22+00:00",
    "score": 70,
    "summary": "Oops, something went wrong Insurance operator Stand has announced the completion of a $35m Series B funding round led by Eclipse to broaden its reach into Florida. In existence of just over a year, Stand has established a presence in California, underwriting an insured value of $1bn. Eclipse's $30m investment in Stand reflects our conviction that resilience is the future, giving property owners the tools to safeguard their properties and their futures.\" Stand stated that its leadership team includes experts with experience in various sectors including insurance, technology and applied sciences."
  }
]